#ifndef VECTOR_FUNC_H
#define VECTOR_FUNC_H

#include "VectorType.h"

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция создания динамического массива с авто расширением
 * \param [in] vector Указатель на структуру вектора
*/
int vectorCtr (TokenVector_t* vector);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция добавления элемента в вектор
 * \param [in] vector Указатель на структуру вектора
 * \param [in] token Добавляемый элемент
*/
int vectorAdd (TokenVector_t* vector,
               const VectorVar_t token);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция получения текущего количества элементов в векторе
 * \param [in] vector Указатель на структуру вектора
 * \return Количество элементов
*/
size_t vectorGetSize (TokenVector_t* vector);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция получения элемента вектора по его индексу
 * \param [in] vector Указатель на структуру вектора
 * \param [in] index Индекс элемента
 * \return Указатель на элемента в случае успеха, иначе NULL
*/
VectorVar_t* vectorGetToken (TokenVector_t* vector,
                             size_t index);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция удаления памяти вектора
 * \param [in] vector Указатель на структуру вектора
*/
int vectorDtr (TokenVector_t* vector);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция удаления элемента вектора
 * \param [in] token Указатель на элемент
*/
int vectorDtrToken (VectorVar_t* token);
// ---------------------------------------------------------------------------------------------------

#endif /* VECTOR_FUNC_H */
