#ifndef PARSER_TREE_H
#define PARSER_TREE_H

#include "NodeType.h"
#include "ConfigTreeConst.h"


// ---------------------------------------------------------------------------------------------------
enum BACK_ERRORS
{
    BACK_ERROR_NOT_LEFT_ROUND,
    BACK_ERROR_SCANF,
    BACK_ERROR_VAR,
    BACK_ERROR_OPER,
    BACK_ERROR_NUM,
    BACK_ERROR_KEY,
    BACK_ERROR_UNKNOWN_TYPE,
    BACK_ERROR_NOT_RIGHT_ROUND
};
// ---------------------------------------------------------------------------------------------------


// ---------------------------------------------------------------------------------------------------
/**
 * \ Функция нахождения значения для команды по имени команды
 * \param [in] data Указатель на структуру хранения
 * \param [in] size Количество элементов в этой базе данных
 * \param [in] name Имя команды
 * \return Значение, соответствующее этой команде
*/
int findWordValue (const SystemSyntaxWord_t* data,
                    size_t size,
                    char* name);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция чтения буфера и построения по нему дерева
 * \param [in] parent Указатель на родительский узел
 * \param [in] pose Указатель на файл дерева
 * \return Указатель на созданный узел
*/
Node_t* readNode (Node_t* parent,
                  char** pose);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция вывода описания ошибки по её номеру
 * \param [in] error Номер ошибки
 */
void parserError (BACK_ERRORS error);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Рекурсивная функция удаления узлов поддерева
 * \param [in] node Указатель на корень поддерева
 */
void deleteNode (Node_t* node);
// ---------------------------------------------------------------------------------------------------


#endif /* PARSER_TREE_H */
