#ifndef NAME_TABLE_FUNC_H
#define NAME_TABLE_FUNC_H


#include "NameTableType.h"


// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция создания таблицы имен
 @param [in] table Указатель на структуру таблицы имен
*/
int nameTableCtr (NameTable_t* table);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция удаления структуры таблицы имен
 @param [in] table Указатель на структуру таблицы имен
*/
int nameTableDtr (NameTable_t* table);
// ---------------------------------------------------------------------------------------------------


// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция поиска имени в таблице имен
 @param [in] table Указатель на структуру таблицы имен
 @param [in] name Полученное имя
 @return Индекс переменной с таким именем в таблице имен,
         если не найдет (size_t) -1
*/
size_t nameTableFind (NameTable_t* table,
                      NameTableName_t name);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция сравнения элементов таблицы имен по их хешам
 @param [in] var_1 Указатель на первый элемент
 @param [in] var_2 Указатель на второй элемент
 @return 0, если совпадают хеши и имена, 1 - если совпадают только хеши,
         иначе 1, если hash_1 > hash_2, 0 если hash_1 < hash_2
*/
int compareVar (const void* var_1,
                const void* var_2);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция, возвращающая имя, лежащее под полученным индексом
 @param [in] table Указатель на таблицу имен
 @param [in] index Полученный индекс
 @return Имя, иначе NULL
*/
NameTableName_t nameTableGetName (const NameTable_t* table,
                                  const size_t index);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция получения текущего размера таблицы имен
 @param [in] table Указатель на структуру таблицы
 @return Размер
*/
size_t nameTableGetSize (NameTable_t* table);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция добавления элемента в таблицу имен
 @param [in] table Указатель на таблицу имен
 @param [in] name Имя добавляемого объекта
 @param [in] value Значение, соответствующее имени
 @param [in] len_name Длина имени
 @return Индекс имени в таблице имен (при ошибке (size_t) -1)
*/
size_t nameTableAdd (NameTable_t* table,
                     NameTableName_t name,
                     NameTableValue_t value,
                     size_t len_name);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция создания структуры стека
 @param [in] stack Указатель на структуру стека
*/
int nameTableStackCtr (NameTableStack_t* stack);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция пуша таблицы имен в стек
 @param [in] stack Указатель на структуру стека
 @param [in] table Указатель на таблицу имен
*/
int nameTableStackPush (NameTableStack_t* stack,
                        NameTable_t* table);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
NameTable_t* nameTableStackPop (NameTableStack_t* stack);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
int nameTableStackDtr (NameTableStack_t* stack);
// ---------------------------------------------------------------------------------------------------



#endif // NAME_TABLE_FUNC_H
