#ifndef SUPPORT_FUNC_H
#define SUPPORT_FUNC_H

#include <cstddef>

// ---------------------------------------------------------------------------------------------------
/// @brief
#define Log_War(__text__)                                           \
    do {                                                            \
        pushLogFile ("War: " __text__, __FILE__, __LINE__);         \
    } while (0)
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/// @brief
#define Log_Error(__text__)                                         \
    do {                                                            \
        pushLogFile ("Err: " __text__, __FILE__, __LINE__);         \
    } while (0)
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/// @brief
#define Log_Info(__text__)                                          \
    do {                                                            \
        pushLogFile ("Inf: " __text__, __FILE__, __LINE__);         \
    } while (0)
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
#define EXIT_FUNC(reason, ret_var)                                  \
    do {                                                            \
        printf ("ERROR in %s:%d : %s", __FILE__, __LINE__, reason); \
        Log_Error (reason);                                         \
        return ret_var;                                             \
    } while (0)
// ---------------------------------------------------------------------------------------------------



// --------------------------------------------------------------------------------------------------
/**
 * @brief Хеш-функция
 * @param [in] string Строка, которая преобразуется в хеш
 * @return Хеш строки
*/
size_t getHash (const char* string);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция, находящая размер файла в байтах по его имени
 * @param [in] name_file Имя файла
 * @return Размер файла
*/
size_t getFileSize (const char* name_file);
// -------------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция загрузки содержимого файла в буфер
 @param [in] name_file Имя загружаемого файла
 @return Указатель на выделенную динамически память
*/
char* createCharBuffer (const char* name_file);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция отправки информации в лог файл
 @param [in] text Текст сообщения
 @param [in] file Файл откуда произошел вызов
 @param [in] line Строка откуда произошел вызов
*/
int pushLogFile (const char* text,
                 const char* file,
                 int line);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция очистки log файла
*/
int cleanLogFile ();
// ---------------------------------------------------------------------------------------------------


#endif /* SUPPORT_FUNC_H */
