#ifndef TOKEN_TYPE_H
#define TOKEN_TYPE_H

#include "TypesOfType.h"


// ---------------------------------------------------------------------------------------------------
/// @brief Контекстная информация при токенизации
struct TokenContextInf_t
{
    char** pose;
    int line;
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
struct SystemSyntaxWord_t
{
    const char* name;
    NodeType_t type;
    int value;
};
// ---------------------------------------------------------------------------------------------------

#endif /* TOKEN_TYPE_H */
