#ifndef NAME_TABLE_FUNC_H
#define NAME_TABLE_FUNC_H

#include "NameTableType.h"


// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция создания таблицы имен
 @param [in] table Указатель на структуру таблицы имен
*/
int nameTableCtr (NameTable_t* table);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция удаления структуры таблицы имен
 @param [in] table Указатель на структуру таблицы имен
*/
int nameTableDtr (NameTable_t* table);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция поиска имени в таблице имен
 @param [in] table Указатель на структуру таблицы имен
 @param [in] name Полученное имя
 @return Указатель на структуру таблицы переменных, если найдена,
         иначе NULL
*/
NameTableVar_t* nameTableFind (NameTable_t* table,
                               char* name);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция сравнения элементов таблицы по хешу
 @param [in] void_var_1 Указатель на первый элемент
 @param [in] void_var_2 Указатель на второй элемент
 @return sign (var_1.hash - var_2.hash)
*/
int compareVarByHash (const void* void_var_1,
                      const void* void_var_2);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция сравнения хеша и элемента таблицы по хешу
 @param [in] void_hash_1 Указатель на хеш
 @param [in] void_var_2 Указатель на элемент
 @return sign (hash_1 - var_2.hash)
*/
int compareVarAndHash (const void* void_hash_1,
                       const void* void_var_2);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция получения текущего размера таблицы имен
 @param [in] table Указатель на структуру таблицы
 @return Размер
*/
size_t nameTableGetSize (NameTable_t* table);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция добавления элемента в таблицу имен
 @param [in] table Указатель на таблицу имен
 @param [in] name Имя добавляемого объекта
 @return Указатель на элемент
*/
NameTableVar_t* nameTableAdd (NameTable_t* table,
                              char* name);
// ---------------------------------------------------------------------------------------------------



// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция создания структуры стека
 @param [in] stack Указатель на структуру стека
*/
int nameTableStackCtr (NameTableStack_t* stack);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция пуша таблицы имен в стек
 @param [in] stack Указатель на структуру стека
 @param [in] table Указатель на таблицу имен
*/
int nameTableStackPush (NameTableStack_t* stack,
                        NameTable_t* table);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция POPа элемента из стека
 @param [in] stack Указатель на структуру стека
 @return Элемент, который POPнули
*/
NameTable_t* nameTableStackPop (NameTableStack_t* stack);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция, возвращающая элемент под переданным индексом
 @param [in] stack Указатель на структуру стека
 @param [in] index Переданный индекс
 @return Элемент, если успешно, иначе NULL
*/
NameTable_t* nameTableStackGetEl (NameTableStack_t* stack,
                                  size_t index);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция удаления стека
 @param [in] stack Укащатель на структуру стека
*/
int nameTableStackDtr (NameTableStack_t* stack);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция получения размера стека
 @param [in] stack Указатель на структуру стека
 @return Размер стека
*/
size_t nameTableStackGetSize (NameTableStack_t* stack);
// ---------------------------------------------------------------------------------------------------


#endif // NAME_TABLE_FUNC_H
