#ifndef VAR_FUNC_TYPE_H
#define VAR_FUNC_TYPE_H


// ---------------------------------------------------------------------------------------------------
/// @brief Возможные значения элемента таблицы имен
union ValueIndent_t
{
    int adr;
    int agrc;
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/// @brief Структура элемента таблицы имен с конечным автоматроном
struct Indent_t
{
    size_t hash;
    char* name;
    ValueIndent_t val;
    Indent_t* next;
};
// ---------------------------------------------------------------------------------------------------


#endif /* VAR_FUNC_TYPE_H */
