#ifndef NODE_FUNC_H
#define NODE_FUNC_H

#include "NodeType.h"


// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция добавления детей node_2 к детям node_1
 @param [in] node_1 К чьим детям пойдет прибавление
 @param [in] node_2 Чьих детей добавляют
*/
int addChildren (Node_t* node_1,
                 Node_t* node_2);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция добавления child в дети parent
 @param [in] parent Кому добавляются дети
 @param [in] child Кого добавляют
*/
int addNode (Node_t* parent,
             Node_t* child);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция выделения динамической памяти под узел
 @return Указатель на выделенную память
*/
Node_t* newNode ();
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 @brief Функция удаления буферного элемента
 @param [in] node Указатель на узел, который будет удален
 @note Удаляет только память узла и САМ УЗЕЛ (он должен быть выделен через дин. память)
*/
int deleteOneNode (Node_t* node);
// ---------------------------------------------------------------------------------------------------


#endif /* NODE_FUNC_H */
