#ifndef NODE_TYPE_H
#define NODE_TYPE_H

#include <stdio.h>
#include "NameTableType.h"
#include "TypesOfType.h"


// ---------------------------------------------------------------------------------------------------
/// @brief
struct ParserVar_t
{
    NameTable_t* table;
    size_t address;
    double value;
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/// @brief
struct ParserFunc_t
{
    size_t amount_args;
};
// ---------------------------------------------------------------------------------------------------
/*
// ---------------------------------------------------------------------------------------------------
/// @brief
struct CompilerTree_t
{
    CompilerNode_t* root;
    size_t size;
};
// ---------------------------------------------------------------------------------------------------
*/
/*
// ---------------------------------------------------------------------------------------------------
/// @brief Возможные значения узлов
union NodeValue_t
{
    int oper;
    int key;
    int punct;
    int num;
    int nest;
    char* name;
};
// ---------------------------------------------------------------------------------------------------
*/
// ---------------------------------------------------------------------------------------------------
union NodeValue_t
{
// !!!!!!!!! Очень важно!! Пока необходимо, что бы в структурах всегда char* стояло первым
// Перемена их местами может привести к багу

    /* Структура для хранения переменных */
    struct {    char* name;
                int point_level;
                char* type; } var;

    /* Структура для хранения функций */
    struct {    char* name;
                int ret_point_level;
                char* ret_type; } func;

    struct {    int val;
                int point_level;
                char* type; } oper;

    struct {    int val;
                int point_level;
                char* type; } num;
    int key;
    int punct;
    char* name;
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/// @brief Структура узла дерева
struct Node_t
{
    NodeType_t type;
    Node_t* parent;
    Node_t** children;
    int amount_children;
    NodeValue_t val;
};
// ---------------------------------------------------------------------------------------------------


#endif /* NODE_TYPE_H */
