#ifndef NODE_TYPE_H
#define NODE_TYPE_H

#include <stdio.h>
#include "NameTableType.h"
#include "TypesOfType.h"


// ---------------------------------------------------------------------------------------------------
struct FullTypeInfo_t
{
    char* type_name;
    int ptr_lvl;
    int array_size;
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
struct ResolveTypeInfo_t
{
    NameTableVar_t* type;
    int ptr_lvl;
    int array_size;
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
union NodeValue_t
{
    int key;
    int punct;
    int num;

    // 1. Только для момента лексического анализа.
    struct {
        char* name;
    } id_raw;

    // 2. Для построения дерева. Функции и переменные обладают одинаковой структурой.
    struct {
        char* name;
        FullTypeInfo_t type;
    } id_tree;

    // 3. Для проверки всех типов и заполнения всех таблиц.
    struct {
        NameTableVar_t* var;
    } id_res;

    struct {
        int code;
        ResolveTypeInfo_t type;
    } oper;

    struct {
        Node_t* prev;
        NameTable_t* table_var;
    } block;

    // Нужен для синтаксического анализа, в котором нет работы с таблицами имен
    // Для этого есть отдельная стадия
    int type_block;
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/// @brief Структура узла дерева
struct Node_t
{
    NodeType_t type_node;

    Node_t* parent;
    Node_t** children;
    int amount_children;

    NodeValue_t val;
};
// ---------------------------------------------------------------------------------------------------


#endif /* NODE_TYPE_H */
