#ifndef TYPES_OF_TYPE_H
#define TYPES_OF_TYPE_H


// ---------------------------------------------------------------------------------------------------
/// @brief Тип бинарной операции
enum Oper_t
{
    // Обычные операции арифметики
    OPER_ADD             = 0,
    OPER_SUB             = 1,
    OPER_MUL             = 2,
    OPER_DIV             = 3,

    // Сравнение
    OPER_E               = 5,    // ==
    OPER_NE              = 6,    // !=
    OPER_L               = 7,    // <
    OPER_LE              = 8,    // <=
    OPER_B               = 9,    // >
    OPER_BE              = 10,   // >=

    // Логические операции
    OPER_AND             = 11,   // &&
    OPER_OR              = 12,   // ||
    OPER_NOT             = 13,   // !

    OPER_DEREF           = 14,
    OPER_ADDR            = 15,
    OPER_ASSIGN          = 16
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/// @brief Тип пунктуации
enum Punct_t
{
    PUNCT_ENDSTRING     = 0,    // \n
    PUNCT_COMMA         = 1,    // ,
    PUNCT_LPAREN        = 2,    // (
    PUNCT_RPAREN        = 3,    // )
    PUNCT_LTANG         = 4,    // <
    PUNCT_RTANG         = 5,    // >
    PUNCT_LBRACKET      = 6,    // [
    PUNCT_RBRACKET      = 7,    // ]
    PUNCT_DOT           = 8,    // .
    PUNCT_COMMENT       = 9,    // #
    PUNCT_COLON         = 10,   // :
    PUNCT_ARROW         = 11,   // ->
};
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/// @brief Тип блока кода
enum BlockType_t
{
    BLOCK_FUNC          = 0,    // Тело функции
    BLOCK_IF            = 1,    // Блок if
    BLOCK_ELSE          = 2,    // Блок else
    BLOCK_WHILE         = 3,    // Блок while
    BLOCK_COMPOUND      = 5,    // Обычный блок { ... }
    BLOCK_PROGRAM       = 6,    // Главный блок программы
};
// ---------------------------------------------------------------------------------------------------


#endif /* TYPES_OF_TYPE_H */
