#ifndef DUMP_FUNC_H
#define DUMP_FUNC_H

#include "NodeType.h"

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция дампа дерева
 @param [in] root Корень дерева
 @param [in] reason Причина дампа
*/
int treeDump (Node_t* root,
              const char* reason);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция создания графа по дереву
 @param [in] root Корень дерева
 @return 0 (если не было ошибок), иначе 1
*/
int createGraph (Node_t* root);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция создания блоков графа
 @param [in] node Указатель на текущий узел
 @param [in] stream Указатель на dot файл
*/
int createBlock (Node_t* node,
                 FILE* stream);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 * \brief Функция записи информации о типе для дампа в строку
 * \param [in] type Указатель на тип
 * \param [in] extra_inf Указатель на строку
 */
void printTypeInfo (TypeEntry_t* type,
                    char* extra_inf);
// ------------------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------------------
/**
 @brief Функция описания блока дерева для кратного дампа
 @param [in] node Узел, блок которого описывается
 @param [in] stream Файл для вывода
*/
int printFullBlock (Node_t* node,
                    FILE* stream);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Функция распечатки адреса в HEX-формате
 @param [in] stream Файл для вывода
 @param [in] address Полученный адрес
*/
int printAddress (FILE* stream,
                  const void* address);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
/**
 @brief Рекурсивная функция создания связей между блоками
 @param [in] node Указатель на текущий узел
 @param [in] stream Указатель на dot файл
*/
int createLine (Node_t* node,
                FILE* stream);
// -------------------------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------------------------
int dumpNode (Node_t* node);
// -------------------------------------------------------------------------------------------------------


#endif /* DUMP_FUNC_H */
