#ifndef WRITE_TREE_H
#define WRITE_TREE_H

#include "NodeType.h"


// ---------------------------------------------------------------------------------------------------
void writeTree (Node_t* root);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция записи узла
 * \param [in] node Указатель на узел
 * \param [in] stream Файл для записи
 * \param [in] amount_last Количество детей полученного узла,
                           которых нужно записать
 */
void writeNode (Node_t* node,
                FILE* stream,
                int amount_last);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция записи типа и значения узла в файл
 * \param [in] node Указатель на узел
 * \param [in] stream Файл для записи
 * \note Открывает скобку '('
 */
void writeValue (Node_t* node,
                 FILE* stream);
// ---------------------------------------------------------------------------------------------------

#endif /* WRITE_TREE_H */
