#ifndef WRITE_CODE_H
#define WRITE_CODE_H

#include "NodeType.h"


// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция записи дерева в формате языка в файл
 * \param [in] root Указатель на корень дерева
 * \param [in] name_file Имя файла, куда будет производиться запись
 */
void writeCodeToFile (Node_t* root,
                      const char* name_file);
// ---------------------------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------------------------
/**
 * \brief Функция записи поддерева в файл
 * \param [in] node Указатель на корень поддерева
 * \param [in] number_tab Количество TAB, которое нужно поставить перед выводимой точкой
 * \param [in] stream Указатель на файл
 */
void writeCode (Node_t* node,
                int number_tab,
                FILE* stream);
// ---------------------------------------------------------------------------------------------------


#endif /* WRITE_CODE_H */
